#include"main.h"

int main(){
	

	return 0;
}
/*
1) реализовать класс запекания вывода и оптимизировать его-доделать
2) реализовать класс камеры -доделать
3) реализовать папку текстур чтобы не висели в памяти . сравнит скорости-доделать
4) реализовать класс времени -нет необходимости
5) СОЗДАТЬ NAMESPASEЫ-продумать функции
6) КЛАСС ИВЕНТОВ -доделать
7) класс девайсов -подумать
8) создать папку предварительных настроек
9) создать координатную плоскость 
10)реализовать вывод букв 
11)реализовать scenes
12)класс update-доделать
13)реализовать creator
14)сделать более красивый draw вывод 
15)сделать автоматическую догрузку кассов в objmanager
16)продумать класс окна
------------------
пока все, удачи





*/